<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <meta name="GENERATOR" content="Mozilla/4.7 [en] (WinNT; U) [Netscape]">
   <title>Title</title>
<!--Created by Applixware HTML Author, Release 4.4 on Tue Jun 29 10:47:34 1999-->
<!--Ax:WP:DocVar:HTMLOriginalPath@:"/var/tmp/ex04019p.aw"-->
</head>
<body>
<pre>This is a translation of the <a href="common/lgpl-licence.html">GNU Lesser General Public License</a>
into Hungarian. This translation is distributed in the hope that it will
facilitate understanding, but it is not an official or legally approved
translation.</pre>
<p>The Free Software Foundation is not the publisher of this translation
and has not approved it as a legal substitute for the authentic <a href="common/lgpl-licence.html">GNU Lesser
General Public License</a>. The translation has not been reviewed carefully by lawyers,
and therefore the translator cannot be sure that it exactly represents
the legal meaning of the <a href="common/lgpl-licence.html">GNU Lesser General Public License</a>. If you wish to be
sure whether your planned activities are permitted by the <a href="common/lgpl-licence.html">GNU Lesser General 
Public License</a>, please refer to the authentic English version.
<p>The Free Software Foundation strongly urges you not to use this translation
as the official distribution terms for your programs; instead, please use
the authentic English version published by the Free Software Foundation.
<br>
<hr WIDTH="100%">
<p><b><u>GNU K&Ouml;NYVT&Aacute;RI &Aacute;LTAL&Aacute;NOS NYILV&Aacute;NOS
JOGOS&Iacute;TV&Aacute;NY</u></b>
<p>2. Verzi&oacute;, 1991 j&uacute;nius

</p>
<pre>Copyright (C) 1989, 1991 Free Software Foundation, Inc.
675 Mass Ave, Cambridge, MA 02139, USA
B&aacute;rki sz&aacute;m&aacute;ra megengedett ezen licenc dokumentum
sz&oacute; szerinti k&oacute;pi&aacute;inak m&aacute;sol&aacute;sa &eacute;s
terjeszt&eacute;se, de nem enged&eacute;lyezett ennek megv&aacute;ltoztat&aacute;sa.

[Ez a k&ouml;nyvt&aacute;ri &Aacute;NYJ
els&otilde; kiadott v&aacute;ltozata. 2-nek az&eacute;rt van nevezve, mert
egy&uuml;tt jelenik meg a k&ouml;z&ouml;ns&eacute;ges &Aacute;NYJ 2-es
verzi&oacute;j&aacute;val.]
</pre>
<p><b>Bevezet&eacute;s</b>
<p>A legt&ouml;bb szoftver licenc&eacute;t arra tervezt&eacute;k, hogy
megvonja az &ouml;n szabads&aacute;g&aacute;t a megv&aacute;ltoztat&aacute;s&aacute;ra
&eacute;s terjeszt&eacute;s&eacute;re. Ezzel ellent&eacute;tben, a GNU
&Aacute;ltal&aacute;nos Nyilv&aacute;nos Jogos&iacute;tv&aacute;ny arra
van sz&aacute;nva, hogy garant&aacute;lja az &ouml;n szabads&aacute;g&aacute;t
szabad szoftver megv&aacute;ltoztat&aacute;s&aacute;ra &eacute;s terjeszt&eacute;s&eacute;re-
bizonyoss&aacute; tegye, hogy a szoftver szabad minden felhaszn&aacute;l&oacute;ja
sz&aacute;m&aacute;ra.
<p>Ez a jogos&iacute;tv&aacute;ny, a K&ouml;nyvt&aacute;ri &Aacute;ltal&aacute;nos
Nyilv&aacute;nos Jogos&iacute;tv&aacute;ny sz&aacute;mos, k&uuml;l&ouml;n
a Szabad Szoftver Alap&iacute;tv&aacute;ny &aacute;ltal kijel&ouml;lt szoftvere
vonatkozik, &eacute;s valamely m&aacute;s k&ouml;nyvt&aacute;rakra, melyeknek
a szerz&otilde;i ennek a haszn&aacute;lata mellett d&ouml;nt&ouml;ttek.
Ezt &ouml;n is haszn&aacute;lhatja a saj&aacute;t k&ouml;nyvt&aacute;raiban.
<p>Amikor szabad szoftverr&otilde;l besz&eacute;l&uuml;nk, akkor a szabads&aacute;gra
utalunk, nem az &aacute;rra. A mi &Aacute;ltal&aacute;nos nyilv&aacute;nos
Jogos&iacute;tv&aacute;nyainkat arra tervezt&uuml;k,
<p>hogy biztoss&aacute; tegy&eacute;k, &ouml;nnek szabads&aacute;ga van
terjeszteni a szabad szoftverek m&aacute;solatait (&eacute;s k&ouml;lts&eacute;get
felsz&aacute;m&iacute;tani a szolg&aacute;ltat&aacute;s&eacute;rt, ha akarja),
amelyek forr&aacute;sk&oacute;dj&aacute;t megkapja vagy megkaphatja,
ha akarja, amely szoftvert megv&aacute;ltoztathat vagy darabjait haszn&aacute;lhatja
&uacute;j szabad programokban: &eacute;s tudja azt, hogy megteheti ezeket
a dolgokat.
<p>Jogainak v&eacute;delm&eacute;re, sz&uuml;ks&eacute;gesnek tartjuk korl&aacute;toz&aacute;sok
megt&eacute;tel&eacute;t, melyek megtiltj&aacute;k, hogy valaki megtagadja
&ouml;nt&otilde;l ezeket a jogokat vagy &ouml;nt a jog&aacute;r&oacute;l
lemond&aacute;sra k&eacute;rje. Ezek a korl&aacute;toz&aacute;sok az &ouml;n
bizonyos k&ouml;telezetts&eacute;geire vannak &eacute;rtelmezve, ha a k&ouml;nyvt&aacute;rak
m&aacute;solatait terjeszti, vagy m&oacute;dos&iacute;tja azokat.
<p>P&eacute;ld&aacute;ul, ha a k&ouml;nyvt&aacute;rak m&aacute;solatait
terjeszti, ak&aacute;r ingyen, ak&aacute;r d&iacute;jaz&aacute;s&eacute;rt,
a c&iacute;mzetteknek meg kell adnia mindazokat a jogokat, amelyeket mi
megadtunk &ouml;nnek. Ha &ouml;sszekapcsol egy programot a k&ouml;nyvt&aacute;rral,
&aacute;t kell adnia a c&iacute;mzettek- nek a f&aacute;jlok teljes t&aacute;rgyk&oacute;dj&aacute;t
&uacute;gy, hogy lehet&otilde;s&eacute;g&uuml;k legyen sz&eacute;tkapcsolni,
v&aacute;ltoztat&aacute;s ut&aacute;n visszakapcsolni a k&ouml;nyvt&aacute;rhoz
&eacute;s &uacute;jraszerkeszteni azt. &Eacute;s ismertetnie kell vel&uuml;k
ezeket a kik&ouml;t&eacute;seket, hogy &otilde;k is megismerhess&eacute;k
jogaikat.
<p>A jogait k&eacute;t l&eacute;p&eacute;ssel v&eacute;dj&uuml;k: (1) szerz&otilde;i
jogot tartunk fenn, &eacute;s (2) &aacute;tadjuk &ouml;nnek ezt a jogos&iacute;v&aacute;nyt,
amely jogos enged&eacute;lyt ad a szoftver m&aacute;sol&aacute;s&aacute;ra,
terjeszt&eacute;s&eacute;re &eacute;s/vagy m&oacute;dos&iacute;t&aacute;s&aacute;ra.
<p>Tov&aacute;bb&aacute; minden szerz&otilde; v&eacute;delm&eacute;re,
biztos&iacute;tani akarjuk, hogy b&aacute;rki meg&eacute;rtse, nincs szavatoss&aacute;g
ezekre a szabad k&ouml;nyvt&aacute;rakra. Ha a k&ouml;nyvt&aacute;rat valaki
m&oacute;dos&iacute;totta &eacute;s tov&aacute;bb adta, azt akarjuk, hogy
a c&iacute;mzett tudja, amije van, az nem az eredeti verzi&oacute;, &iacute;gy
egy m&aacute;sok &aacute;ltal bevitt b&aacute;rmilyen probl&eacute;ma nem
vet rossz f&eacute;nyt az eredeti szerz&otilde;k j&oacute; h&iacute;rnev&eacute;re.
<p>V&eacute;g&uuml;l, egy szabad program &aacute;lland&oacute;an fenyegetve
van szoftver szabadalmakt&oacute;l. El akarjuk ker&uuml;lni azt a vesz&eacute;lyt,
hogy szabad program eloszt&oacute; t&aacute;rsas&aacute;gok egyedileg szabadalmi
jogosults&aacute;ghoz jussanak, &iacute;gy val&oacute;j&aacute;ban szabadalmazott
programm&aacute; alak&iacute;ts&aacute;k. Ennek megel&otilde;z&eacute;s&eacute;re
kinyilv&aacute;n&iacute;tjuk, hogy b&aacute;rmely szabadalom, amelyet valaki
v&eacute;deni k&iacute;v&aacute;n, szabad haszn&aacute;lat&uacute; &eacute;s
egy&aacute;ltal&aacute;n nem v&eacute;dett.
<p>A legt&ouml;bb, valamilyen k&ouml;nyvt&aacute;r &aacute;ltal tartalmazott
GNU szoftver a k&ouml;z&ouml;ns&eacute;ges GNU &Aacute;ltal&aacute;nos
Nyilv&aacute;nos Jogos&iacute;tv&aacute;nnyal van lefedve, amely utility
programok sz&aacute;m&aacute;ra van tervezve. Ez a jogos&iacute;tv&aacute;ny,
a GNU K&ouml;nyvt&aacute;ri &Aacute;ltal&aacute;nos nyilv&aacute;nos Jogos&iacute;tv&aacute;ny
bizonyos, erre sz&aacute;nt k&ouml;nyvt&aacute;rakra vonatkozik. Ez a jogos&iacute;tv&aacute;ny
alig k&uuml;l&ouml;nb&ouml;zik a k&ouml;z&ouml;ns&eacute;ges m&aacute;sikt&oacute;l:
felt&eacute;tlen&uuml;l olvassa el teljes eg&eacute;sz&eacute;ben, &eacute;s
ne t&eacute;telezze fel, hogy b&aacute;rmi, ami ebben van, ugyanaz, mint
a k&ouml;z&ouml;ns&eacute;ges jogos&iacute;tv&aacute;nyban.
<p>Az ok, ami&eacute;rt k&uuml;l&ouml;n nyilv&aacute;nos jogos&iacute;tv&aacute;nyunk
van sz&aacute;mos k&ouml;nyvt&aacute;rra, az, hogy az emberek &aacute;ltal&aacute;ban
elhom&aacute;lyos&iacute;tj&aacute;k a megk&uuml;l&ouml;nb&ouml;ztet&eacute;st,
amit mi megtesz&uuml;nk egy program m&oacute;dos&iacute;t&aacute;sa vagy
hozz&aacute;t&eacute;tele &eacute;s annak egyszer&ucirc; haszn&aacute;lata
k&ouml;z&ouml;tt. Egy program hozz&aacute;f&ucirc;z&eacute;se egy k&ouml;nyvt&aacute;rhoz,
a k&ouml;nyvt&aacute;r megv&aacute;ltoztat&aacute;sa n&eacute;lk&uuml;l
sz&aacute;mos v&eacute;lem&eacute;ny szerint egyszer&ucirc;en a k&ouml;nyvt&aacute;r
haszn&aacute;lata, &eacute;s anal&oacute;g egy utility vagy alkalmaz&oacute;i
program futat&aacute;s&aacute;val. Azonban sz&ouml;veg szerinti &eacute;s
jogi &eacute;rtelemben a hozz&aacute;f&ucirc;z&ouml;tt v&eacute;grehajthat&oacute;
program egy kombin&aacute;lt munka, egy sz&aacute;rmaz&eacute;ka az eredeti
k&ouml;nyvt&aacute;rnak, &eacute;s a k&ouml;z&ouml;ns&eacute;ges &Aacute;ltal&aacute;nos
Nyilv&aacute;nos Jogos&iacute;tv&aacute;ny &iacute;gy is kezeli azt.
<p>Ennek az elhom&aacute;lyos&iacute;tott megk&uuml;l&ouml;nb&ouml;ztet&eacute;snek
a k&ouml;vetkezt&eacute;ben a k&ouml;z&ouml;ns&eacute;ges &Aacute;ltal&aacute;nos
Nyilv&aacute;nos Jogos&iacute;tv&aacute;ny haszn&aacute;lata a k&ouml;nyvt&aacute;rakra
nem seg&iacute;tette ered-m&eacute;nyesen a szoftver megoszt&aacute;st,
mivel a fejleszt&otilde;k legt&ouml;bbje nem haszn&aacute;lta a k&ouml;nyvt&aacute;rakat.
Arra a k&ouml;vetkeztet&eacute;sre jutottunk, hogy gyeng&eacute;bb felt&eacute;telek
jobban el&otilde;seg&iacute;thetik a megoszt&aacute;st.
<p>Azonban a nem-szabad programok korl&aacute;tlan csatlakoztat&aacute;sa
megfosztan&aacute; azoknak a programoknak a haszn&aacute;l&oacute;it minden
j&oacute;t&eacute;tem&eacute;nyt&otilde;l, amely maguknak a k&ouml;nyvt&aacute;rak-nak
a szabad st&aacute;tus&aacute;b&oacute;l ered. Ez a K&ouml;nyvt&aacute;ri
&Aacute;ltal&aacute;nos Nyilv&aacute;nos Nyilv&aacute;nos Jogos&iacute;tv&aacute;ny
arra van tervezve, hogy lehet&otilde;v&eacute; tegye nem-szabad programok
fejleszt&otilde;inek szabad k&ouml;nyvt&aacute;rak haszn&aacute;lat&aacute;t,
mialatt ilyen programok haszn&aacute;l&oacute;jak&eacute;nt meg- &otilde;rzik
az &ouml;n szabads&aacute;g&aacute;t az azokat befoglal&oacute; k&ouml;nyvt&aacute;rak
megv&aacute;ltoztat&aacute;s&aacute;ra. (M&eacute;g nem l&aacute;ttuk,
hogyan &eacute;rhet&otilde; ez el fejl&eacute;c f&aacute;jlok megv&aacute;ltoztat&aacute;sa
vonatkoz&aacute;- s&aacute;ban- de megval&oacute;s&iacute;tottuk ezt a
k&ouml;nyvt&aacute;rak t&eacute;nyleges m&ucirc;k&ouml;d&eacute;se megv&aacute;ltoztat&aacute;-
s&aacute;nak vonatkoz&aacute;s&aacute;ban.). Rem&eacute;lj&uuml;k, hogy
ez a szabad k&ouml;nyvt&aacute;rak gyorsabb fejlesz- t&eacute;s&eacute;t
fogja kezdem&eacute;nyezni.
<p>A m&aacute;sol&aacute;s, terjeszt&eacute;s &eacute;s m&oacute;dos&iacute;t&aacute;s
pontos k&ouml;vetelm&eacute;nyei &eacute;s felt&eacute;telei k&ouml;vetkeznek.
Ford&iacute;tson alapos figyelmet a „k&ouml;nyvt&aacute;ron alapul&oacute;
munka'' &eacute;s a „k&ouml;nyvt&aacute;rat haszn&aacute;l&oacute; munka''
k&ouml;z&ouml;tti k&uuml;l&ouml;nbs&eacute;gre. Az el&otilde;bbi a k&ouml;nyvt&aacute;rb&oacute;l
sz&aacute;rmaz&oacute; k&oacute;dot tartalmaz, m&iacute;g az ut&oacute;bbi
csak egy&uuml;ttm&ucirc;k&ouml;dik a k&ouml;nyvt&aacute;rral.
<p>Megjegyezz&uuml;k, lehets&eacute;ges egy k&ouml;nyvt&aacute;r sz&aacute;m&aacute;ra,
hogy ink&aacute;bb a k&ouml;z&ouml;ns&eacute;ges &Aacute;ltal&aacute;nos
Nyilv&aacute;nos Jogos&iacute;tv&aacute;nnyal legyen lefedve, mint ezzel
a speci&aacute;lissal.
<p><b>GNU K&Ouml;NYVT&Aacute;RI &Aacute;LTAL&Aacute;NOS NYILV&Aacute;NOS
JOGOS&Iacute;TV&Aacute;NY KIK&Ouml;T&Eacute;SEK &Eacute;S FELT&Eacute;TELEK
M&Aacute;SOL&Aacute;GHOZ, TERJESZT&Eacute;SHEZ &Eacute;S M&Oacute;DOS&Iacute;T&Aacute;SHOZ</b>
<p><b>0.</b> Ez a Jogos&iacute;tv&aacute;ny
Egyezm&eacute;ny olyan szoftver k&ouml;nyvt&aacute;rra vonatkozik, amelyek
tartalmaz a szerz&otilde;i jog tulajdonos vagy m&aacute;sik jogosult f&eacute;l
&aacute;ltal elhelyezett k&ouml;zlem&eacute;nyt, amely kijelenti, hogy
az terjeszthet&otilde; ennek a K&ouml;nyvt&aacute;ri &Aacute;ltal&aacute;nos
nyilv&aacute;nos Jogos&iacute;tv&aacute;nynak („ezen Jogos&iacute;tv&aacute;ny''-nak
is nevezett) k&ouml;vetelm&eacute;nyei alatt. Minden jogosultat „&ouml;n''-nek
c&iacute;mez&uuml;nk.
<p>A „k&ouml;nyvt&aacute;r'' szoftver funkci&oacute;k &eacute;s/vagy adatok
gy&ucirc;jtem&eacute;ny&eacute;t jelenti, melyek &uacute;gy vannak el&otilde;k&eacute;sz&iacute;tve,
hogy alkalmasan hozz&aacute;f&ucirc;zhet&otilde;k legyenek alkalmaz&oacute;i
programokhoz (amelyek haszn&aacute;lj&aacute;k annak funkci&oacute;it &eacute;s
adatait) v&eacute;grehajthat&oacute; program kialak&iacute;t&aacute;s&aacute;ra.
<p>A „K&ouml;nyvt&aacute;r'' az al&aacute;bbiakban olyan szoftver k&ouml;nyvt&aacute;rat
vagy munk&aacute;t jelent, amely ezen k&ouml;vetelm&eacute;nyek alatt terjeszthet&otilde;.
A „K&ouml;nyvt&aacute;ron alapul&oacute; munka'' jelenti vagy a K&ouml;nyvt&aacute;rat,
vagy a szerz&otilde;i jog al&aacute; tartoz&oacute; sz&aacute;rmaz&eacute;kos
munk&aacute;t: azt mondhatjuk, egy munk&aacute;t, amely tartalmazza a K&ouml;nyvt&aacute;rat
vagy annak egy r&eacute;sz&eacute;t, vagy sz&oacute; szerint vagy m&oacute;dosulatk&eacute;nt
&eacute;s/vagy leford&iacute;tva k&ouml;zvetlen&uuml;l m&aacute;s nyelvre.
(A tov&aacute;bbiakban a ford&iacute;t&aacute;st bele&eacute;rtj&uuml;k
korl&aacute;toz&aacute;s n&eacute;lk&uuml;l a „m&oacute;dos&iacute;t&aacute;s''
kifejez&eacute;sbe.)
<p>„Forr&aacute;sk&oacute;d'' egy munka sz&aacute;m&aacute;ra a munka bemutatott
form&aacute;j&aacute;t jelenti annak m&oacute;dos&iacute;t&aacute;sa elk&eacute;sz&iacute;t&eacute;s&eacute;hez.
Egy k&ouml;nyvt&aacute;r eset&eacute;re a teljes forr&aacute;sk&oacute;d
jelenti az &ouml;sszes forr&aacute;sk&oacute;dot minden tartalmazott modulra,
plusz valamennyi interf&eacute;sz defini&aacute;l&oacute; f&aacute;jlt,
plusz a k&ouml;nyvt&aacute;rba szerkeszt&eacute;s &eacute;s beiktat&aacute;s
ir&aacute;ny&iacute;t&aacute;s&aacute;hoz haszn&aacute;lt le&iacute;r&aacute;st.
<p>A m&aacute;sol&aacute;son, terjeszt&eacute;sen &eacute;s m&oacute;dos&iacute;t&aacute;son
t&uacute;li tev&eacute;kenys&eacute;gek nincsenek lefedve ezen Jogos&iacute;tv&aacute;nnyal,
ezek kiv&uuml;lesnek annak hat&oacute;k&ouml;r&eacute;n. A K&ouml;nyvt&aacute;rat
haszn&aacute;l&oacute; program tev&eacute;kenys&eacute;ge nincs korl&aacute;tozva,
&eacute;s egy ilyen program kimenete csak akkor van lefedve, ha annak tartalma
a K&ouml;nyvt&aacute;ron alapul&oacute; munk&aacute;t k&eacute;pez (f&uuml;ggetlen&uuml;l
a K&ouml;nyvt&aacute;r haszn&aacute;lat&aacute;t&oacute;l az azt &iacute;r&oacute;
eszk&ouml;zben). Hogy ez mikor igaz, az f&uuml;gg att&oacute;l, hogy mit
csin&aacute;l a K&ouml;nyvt&aacute;r, &eacute;s mit a program, amely a
K&ouml;nyvt&aacute;rat haszn&aacute;lja.
<p><b>1.</b> M&aacute;solhatja &eacute;s terjesztheti
a K&ouml;nyvt&aacute;r teljes forr&aacute;sk&oacute;dj&aacute;nak sz&oacute;
szerinti m&aacute;solatait, ahogy megkapta azt, valamilyen hordoz&oacute;n,
felt&eacute;ve, hogy felt&ucirc;n&otilde;en &eacute;s alkalmasan mindegyik
m&aacute;solaton k&ouml;zz&eacute;tesz egy szerz&otilde;i jogi k&ouml;zlem&eacute;nyt
&eacute;s a szavatoss&aacute;g kiz&aacute;r&aacute;s&aacute;t: &eacute;rintetlen&uuml;l
hagy minden k&ouml;zlem&eacute;nyt, amely erre a Jogos&iacute;tv&aacute;nyra
&eacute;s a szavatoss&aacute;g hi&aacute;ny&aacute;ra vonatkozik: &eacute;s
ennek a Jogos&iacute;tv&aacute;nynak a m&aacute;solat&aacute;t a K&ouml;nyvt&aacute;rral
egy&uuml;tt terjeszti.
<p>Felsz&aacute;m&iacute;that d&iacute;jaz&aacute;st egy m&aacute;solat
&aacute;tvitel&eacute;nek fizikai k&ouml;zrem&ucirc;k&ouml;d&eacute;s&eacute;&eacute;rt,
&eacute;s v&aacute;laszt&aacute;sk&eacute;nt felaj&aacute;nlhat szavatoss&aacute;gi
v&eacute;delmet d&iacute;jaz&aacute;s&eacute;rt cser&eacute;be.
<p><b>2.</b> M&oacute;dos&iacute;thatja a K&ouml;nyvt&aacute;r
vagy annak egy r&eacute;sze m&aacute;solat&aacute;t vagy m&aacute;solatait,
&iacute;gy egy, a K&ouml;nyvt&aacute;ron alapul&oacute; munk&aacute;t kialak&iacute;tva,
&eacute;s m&aacute;solhatja &eacute;s terjesztheti az ilyen m&oacute;dosulatokat
vagy munk&aacute;kat a fenti 1. Szakasz k&ouml;vetelm&eacute;nyei szerint,
felt&eacute;ve, hogy eleget tesz az al&aacute;bbi felt&eacute;telek mindegyik&eacute;nek:

<ul>
<li><b>a)</b>
     Mag&aacute;nak a m&oacute;dos&iacute;tott munk&aacute;nak szoftver
     k&ouml;nyvt&aacute;rnak kell lennie.

<p>
<li><b>b)</b>
     &Uacute;gy kell l&eacute;trehoznia a m&oacute;dos&iacute;tott f&aacute;jlokat,
     hogy szembet&ucirc;n&otilde; bejegyz&eacute;st viseljenek kijelentve, hogy 
     &ouml;n megv&aacute;ltoztatta a f&aacute;jlokat &eacute;s k&ouml;z&ouml;lve a
     v&aacute;ltoztat&aacute;s szerint.

<p>
<li><b>c)</b>
     &Uacute;gy kell l&eacute;trehoznia a jogos&iacute;tand&oacute; munka eg&eacute;sz&eacute;t,
     hogy az d&iacute;jaz&aacute;s n&eacute;lk&uuml;l rendelkez&eacute;sre &aacute;lljon
     minden harmadik f&eacute;l r&eacute;sz&eacute;re ezen Jogos&iacute;tv&aacute;ny
     k&ouml;vetelm&eacute;nyei szerint.

<p>
<li><b>d)</b>
     Ha egy m&oacute;dos&iacute;tott k&ouml;nyvt&aacute;rban egy szolg&aacute;ltat&aacute;s
     egy olyan alkalmaz&oacute;i program &aacute;ltal &aacute;tadand&oacute;
     f&uuml;ggv&eacute;nyre vagy adat t&aacute;bl&aacute;zatra hivatkozik, amely
     haszn&aacute;lja a szolg&aacute;ltat&aacute;st, &eacute;s egy argumentumon
     k&iacute;v&uuml;l m&aacute;s is &aacute;tad&aacute;sra ker&uuml;l a szolg&aacute;ltat&aacute;s
     megh&iacute;v&aacute;sakor, akkor j&oacute;hiszem&ucirc; er&otilde;fesz&iacute;t&eacute;st
     kell tennie annak biztos&iacute;t&aacute;s&aacute;ra, hogy abban az esetben,
     ha az alkalmaz&aacute;s nem ad &aacute;t ilyen f&uuml;ggv&eacute;nyt vagy
     t&aacute;bl&aacute;zatot, a szolg&aacute;ltat&aacute;s m&eacute;g m&ucirc;k&ouml;dj&ouml;n,
     &eacute;s hajtsa v&eacute;gre feladat&aacute;nak b&aacute;rmely r&eacute;sz&eacute;t,
     amelynek &eacute;rtelme marad.

     (p&eacute;ld&aacute;ul egy n&eacute;gyzetgy&ouml;k
     kisz&aacute;m&iacute;t&oacute; f&uuml;ggv&eacute;nynek egy k&ouml;nyvt&aacute;rban
     olyan feladata van, amely teljesen j&oacute;l-defini&aacute;lt az alkalmaz&aacute;st&oacute;l
     f&uuml;ggetlen&uuml;l. Ez&eacute;rt a 2d alszakasz megk&ouml;veteli, hogy
     ezen f&uuml;ggv&eacute;ny &aacute;ltal haszn&aacute;lt alkalmaz&aacute;sb&oacute;l
     &aacute;tadott f&uuml;ggv&eacute;nynek vagy t&aacute;bl&aacute;zatnak opcion&aacute;lisnak
     kell lennie: ha az alkalmaz&aacute;s nem adja azt &aacute;t, a n&eacute;gyzetgy&ouml;k
     f&uuml;ggv&eacute;nynek m&eacute;g kell n&eacute;gyzetgy&ouml;k&ouml;t
     sz&aacute;molnia.)

</ul>

Mind&ouml;ssze ezek a k&ouml;vetelm&eacute;nyek vonatkoznak a m&oacute;dos&iacute;tott
munk&aacute;ra. Ha annak a munk&aacute;nak azonos&iacute;that&oacute; r&eacute;szei
nem sz&aacute;rmaznak a K&ouml;nyvt&aacute;rb&oacute;l, &eacute;s indokoltan
tekintetbe vehet&otilde;k f&uuml;ggetlen &eacute;s &ouml;nmagukban elk&uuml;l&ouml;n&iacute;thet&otilde;
munk&aacute;k, akkor ezen Jogos&iacute;tv&aacute;nyt &eacute;s k&ouml;vetelm&eacute;nyeit
nem kell alkalmazni azokra a r&eacute;szekre, amelyeket elk&uuml;l&ouml;n&iacute;tett
munk&aacute;k&eacute;nt terjeszt. De ha &ouml;n ugyanezeket a r&eacute;szeket
&uacute;gy forgal- mazza, mint az eg&eacute;sz k&ouml;nyvt&aacute;ron alapul&oacute;
munka egy r&eacute;sz&eacute;t, az eg&eacute;sz terjeszt&eacute;-s&eacute;nek
meg kell felelnie ezen Jogos&iacute;tv&aacute;ny k&ouml;vetelm&eacute;nyeinek,
amely megengedi m&aacute;s jogosultaknak a kiterjeszt&eacute;s&eacute;t
a teljes eg&eacute;szre, &eacute;s &iacute;gy mindenkinek &eacute;s minden
r&eacute;szre, att&oacute;l f&uuml;ggetlen&uuml;l, hogy ki &iacute;rta
azt.
<p>Teh&aacute;t nem c&eacute;lja ennek a szakasznak, hogy jogokat ig&eacute;nyeljen
vagy a teljes eg&eacute;sz&eacute;ben &ouml;n &aacute;ltal &iacute;rt munk&aacute;kra
k&uuml;zdj&ouml;n az &ouml;n jog&aacute;&eacute;rt: ink&aacute;bb az a
c&eacute;lja, hogy gyakorolja a k&ouml;nyvt&aacute;ron alapul&oacute; k&ouml;z&ouml;s
munk&aacute;k terjeszt&eacute;s&eacute;nek &eacute;s sz&aacute;rmaztat&aacute;s&aacute;nak
ellen&otilde;rz&eacute;si jog&aacute;t.
<p>Mindamellett, a K&ouml;nyvt&aacute;rral (vagy a K&ouml;nyvt&aacute;ron
alapul&oacute; munk&aacute;val) a nem a K&ouml;nyvt&aacute;ron alapul&oacute;
m&aacute;s munk&aacute;k puszta felhalmoz&aacute;sa a t&aacute;rol&oacute;
vagy a forgalmaz&aacute;si k&ouml;zegek t&ouml;meg&eacute;ben nem eredm&eacute;nyezi
a m&aacute;s munk&aacute;k ezen Jogos&iacute;tv&aacute;ny hat&oacute;k&ouml;r&eacute;be
tartoz&aacute;s&aacute;t.
<p><b>3.</b> V&aacute;laszthatja a k&ouml;z&ouml;ns&eacute;ges GNU &Aacute;ltal&aacute;nos
Nyilv&aacute;nos Jogos&iacute;tv&aacute;ny k&ouml;vetel- m&eacute;nyeinek
alkalmaz&aacute;s&aacute;t ezen Jogos&iacute;tv&aacute;ny helyett a K&ouml;nyvt&aacute;r
egy m&aacute;solat&aacute;hoz. Ennek megt&eacute;tel&eacute;hez meg kell
v&aacute;ltoztatnia minden k&ouml;zlem&eacute;nyt, amely ennek a Jogos&iacute;tv&aacute;nynak
felel meg &uacute;gy, hogy az a k&ouml;z&ouml;ns&eacute;ges GNU &Aacute;ltal&aacute;nos
Nyilv&aacute;nos Jogos&iacute;tv&aacute;ny 2. verzi&oacute;j&aacute;nak
feleljen meg ezen Jogos&iacute;tv&aacute;ny helyett. (Ha a k&ouml;z&ouml;ns&eacute;ges
GNU &Aacute;ltal&aacute;nos Nyilv&aacute;nos Jogos&iacute;tv&aacute;ny
2. verzi&oacute;j&aacute;n&aacute;l &uacute;jabb verzi&oacute; jelenik
meg, megadhatja azt a verzi&oacute;t ehelyett, ha akarja.) Ne v&eacute;gezzen
m&aacute;s v&aacute;ltoztat&aacute;st ezekben a k&ouml;zlem&eacute;nyekben.
<p>Ha ez a v&aacute;ltoztat&aacute;s egy adott m&aacute;solatra megt&ouml;rt&eacute;nik,
az visszaford&iacute;thatatlan arra a m&aacute;solatra n&eacute;zve, &iacute;gy
a k&ouml;z&ouml;ns&eacute;ges GNU &Aacute;ltal&aacute;nos Nyilv&aacute;nos
Jogos&iacute;tv&aacute;ny vonatkozik az ennek a m&aacute;solatnak minden
tov&aacute;bbi m&aacute;solat&aacute;ra &eacute;s sz&aacute;rmaz&eacute;k&aacute;ra.
<p>Ez a v&aacute;laszt&aacute;s akkor hasznos, ha a K&ouml;nyvt&aacute;r
k&oacute;dj&aacute;nak egy r&eacute;sz&eacute;t be akarja m&aacute;solni
egy programba, amely nem k&ouml;nyvt&aacute;r.
<p><b>4.</b> M&aacute;solhatja &eacute;s terjesztheti a K&ouml;nyvt&aacute;rat
(vagy annak egy r&eacute;sz&eacute;t vagy sz&aacute;rmaz&eacute;k&aacute;t,
a 2. szakasz szerint) t&aacute;rgyk&oacute;dban vagy v&eacute;grehajthat&oacute;
form&aacute;ban a fenti 1. &eacute;s 2. szakasz k&ouml;vetelm&eacute;nyei
szerint, felt&eacute;ve, hogy ell&aacute;tja azt a megfelel&otilde; g&eacute;ppel-olvashat&oacute;
forr&aacute;sk&oacute;ddal, melyet a fenti 1. &eacute;s 2. szakasz k&ouml;vetelm&eacute;nyei
szerint kell terjeszteni a kereskedelemben szok&aacute;sos szoftver csere
adathordoz&oacute;kon.
<p>Ha a t&aacute;rgyk&oacute;d terjeszt&eacute;se egy megnevezett helyr&otilde;l
t&ouml;rt&eacute;n&otilde; m&aacute;sol&aacute;si el&eacute;rhet&otilde;s&eacute;g
aj&aacute;nl&aacute;sa alapj&aacute;n k&eacute;sz&uuml;lt, akkor a forr&aacute;sk&oacute;d
egyen&eacute;rt&eacute;k&ucirc; m&aacute;sol&aacute;si el&eacute;rhet&otilde;s&eacute;g
aj&aacute;nl&aacute;sa alapj&aacute;n k&eacute;sz&uuml;lt, akkor a forr&aacute;sk&oacute;d
egyen&eacute;rt&eacute;k&ucirc; m&aacute;sol&aacute;si el&eacute;rhet&otilde;s&eacute;g&eacute;nek
aj&aacute;nl&aacute;sa ugyanarr&oacute;l a helyr&otilde;l kiel&eacute;g&iacute;ti
a forr&aacute;sk&oacute;d terjeszt&eacute;s&eacute;nek k&ouml;vetelm&eacute;-
ny&eacute;t, &aacute;mb&aacute;r a harmadik felet nem k&ouml;telezi a forr&aacute;sk&oacute;d
lem&aacute;sol&aacute;s&aacute;ra a t&aacute;rgyk&oacute;ddal egy&uuml;tt.
<p><b>5.</b> Egy programot, amely a K&ouml;nyvt&aacute;r valamilyen r&eacute;sz&eacute;nek
m&oacute;dosulat&aacute;t nem tartalmazza, de arra tervezt&eacute;k, hogy
a K&ouml;nyvt&aacute;rral m&ucirc;k&ouml;dj&eacute;k, l&eacute;v&eacute;n
azzal szerkesztve vagy &ouml;sszef&ucirc;zve, „a K&ouml;nyvt&aacute;rat
haszn&aacute;l&oacute; munk&aacute;nak'' nevezz&uuml;k. Az ilyen munka,
elk&uuml;l&ouml;n&iacute;t&eacute;sben, nem a K&ouml;nyvt&aacute;r sz&aacute;rmaz&eacute;kos
munk&aacute;ja, &eacute;s ez&eacute;rt kiv&uuml;lesik ezen Jogos&iacute;tv&aacute;ny
hat&oacute;k&ouml;r&eacute;n.
<p>Azonban &ouml;sszef&ucirc;zve egy, „ a K&ouml;nyvt&aacute;rat haszn&aacute;l&oacute;''
egy, a K&ouml;nyvt&aacute;r &aacute;ltal l&eacute;trehozott v&eacute;grehajthat&oacute;
programmal, amely a K&ouml;nyvt&aacute;r sz&aacute;rmaz&eacute;ka ( mivel
tartalmazza a K&ouml;nyvt&aacute;r r&eacute;sz&eacute;t), ink&aacute;bb,
mint egy „k&ouml;nyvt&aacute;rat haszn&aacute;l&oacute; munka''. A v&eacute;grehajthat&oacute;
program ez&eacute;rt le van fedve ezzel a Jogos&iacute;tv&aacute;nnyal.
A 6. szakasz k&ouml;zli a k&ouml;vetelm&eacute;nyeket az ilyen v&eacute;grehajthat&oacute;
programok terjeszt&eacute;s&eacute;hez.
<p>Mikor „a K&ouml;nyvt&aacute;rat haszn&aacute;l&oacute;'' egy fejl&eacute;c
f&aacute;jlb&oacute;l haszn&aacute;l anyagot, amely a K&ouml;nyvt&aacute;r
r&eacute;sze, a t&aacute;rgyk&oacute;d a munka sz&aacute;m&aacute;ra lehet
a K&ouml;nyvt&aacute;r sz&aacute;ma- z&eacute;kos munk&aacute;ja m&eacute;g
akkor is, ha a forr&aacute;sk&oacute;d nem. Hogy ez igaz-e, az k&uuml;l&ouml;n&ouml;sen
fontos, ha a munka
&ouml;sszef&ucirc;zhet&otilde; a K&ouml;nyvt&aacute;ron
k&iacute;v&uuml;l, vagy a munka maga egy k&ouml;nyvt&aacute;r. Annak a
k&uuml;sz&ouml;be, hogy ez igaz legyen, nincs a t&ouml;rv&eacute;nyben
pontosan meghat&aacute;rozva.
<p>Ha egy ilyen t&aacute;rgy f&aacute;jl csak numerikus param&eacute;tereket,
adat strukt&uacute;ra elrendez&eacute;seket &eacute;s tartoz&eacute;kokat
haszn&aacute;l, &eacute;s kis makr&oacute;kat &eacute;s kis inline f&uuml;ggv&eacute;nyeket
(t&iacute;z soros vagy kisebb hossz&uacute;s&aacute;g&uacute;t), akkor
a t&aacute;rgy f&aacute;jl haszn&aacute;lata nem korl&aacute;tozott, tekintet
n&eacute;lk&uuml;l ara, hogy az egy leg&aacute;lisan sz&aacute;rmaz&eacute;kos
munka-e. (Azok a v&eacute;grehajthat&oacute; programok, melyek ilyen t&aacute;rgyk&oacute;dot
tartalmaznak plusz a K&ouml;nyvt&aacute;r r&eacute;sz&eacute;t, m&eacute;g
a 6. szakasz hat&aacute;lya al&aacute; esnek.)
<p>Egy&eacute;bk&eacute;nt, ha a munka a K&ouml;nyvt&aacute;rnak egy sz&aacute;rmaz&eacute;ka,
akkor a munk&aacute;hoz a t&aacute;rgyk&oacute;dot a 6. szakasz kik&ouml;t&eacute;sei
szerint terjesztheti. Egy ilyen munk&aacute;t tartalmaz&oacute; v&eacute;grehajthat&oacute;
program szinten a 6. szakasz hat&aacute;lya al&aacute; esik, ak&aacute;r
hozz&aacute; van f&ucirc;zve k&ouml;zvetlen&uuml;l mag&aacute;hoz a K&ouml;nyvt&aacute;rhoz,
ak&aacute;r nem.
<p><b>6.</b> Kiv&eacute;telk&eacute;nt a fenti szakaszhoz, egy „K&ouml;nyvt&aacute;rat
haszn&aacute;l&oacute; munk&aacute;t'' szerkeszthet &eacute;s &ouml;ssze
is f&ucirc;zhet a K&ouml;nyvt&aacute;rral olyan munka l&eacute;trehoz&aacute;s&aacute;ra,
mely tartalmazza a K&ouml;nyvt&aacute;r r&eacute;szeit, &eacute;s terjesztheti
ezeket a munk&aacute;kat az &ouml;n &aacute;ltal v&aacute;lasztott k&ouml;vetelm&eacute;nyek
szerint, felt&eacute;ve, hogy ezek a k&ouml;vetelm&eacute;nyek megengedik
a munka m&oacute;dos&iacute;t&aacute;s&aacute;t az &aacute;tvev&otilde;
saj&aacute;t haszn&aacute;lat&aacute;ra &eacute;s a konstru&aacute;l&aacute;s
megford&iacute;t&aacute;s&aacute;t az ilyen m&oacute;dosulatok visszafejt&eacute;s&eacute;re.
<p>Ennek a munk&aacute;nak minden m&aacute;solat&aacute;val egy&uuml;tt
felt&ucirc;n&otilde; k&ouml;zlem&eacute;nyt kell adnia arr&oacute;l, hogy
a munka, amely a K&ouml;nyvt&aacute;rat haszn&aacute;lja &eacute;s ez a
K&ouml;nyvt&aacute;r le van fedve ezzel a Jogos&iacute;tv&aacute;nnyal.
Mell&eacute;kelnie kell ennek a Jogos&iacute;tv&aacute;nynak egy m&aacute;solat&aacute;t.
Ha a munka v&eacute;grehajt&aacute;s alatt szerz&otilde;i jogi nyilatkozatot
jelen&iacute;t meg, akkor a szerz&otilde;i jogi nyilatkozatot hozz&aacute;
kell sz&aacute;m&iacute;tania ehhez a K&ouml;nyv- t&aacute;rhoz, &eacute;pp
&uacute;gy, mint a hivatkoz&aacute;st a haszn&aacute;l&oacute; utas&iacute;t&aacute;s&aacute;ra,
hogy m&aacute;solja le ezt a Jogos&iacute;tv&aacute;nyt. Tov&aacute;bb&aacute;
meg kell tennie a k&ouml;vetkez&otilde; dolgokat:

<ul>

<li><b>a) </b>
     El kell l&aacute;tnia a munk&aacute;t a teljes, annak megfelel&otilde; g&eacute;ppel-olvashat&oacute;
     forr&aacute;sk&oacute;ddal a K&ouml;nyvt&aacute;rhoz, amely tartalmaz minden,
     a munk&aacute;ban haszn&aacute;lt v&aacute;ltoztat&aacute;st (amelyet a
     fenti 1. &eacute;s 2. szakasz k&ouml;vetelm&eacute;nyei szerint kell terjeszteni):
     &eacute;s, ha a munka egy, a K&ouml;nyvt&aacute;rral &ouml;sszef&ucirc;z&ouml;tt
     v&eacute;grehajthat&oacute; program, a teljes, g&eacute;ppel-olvashat&oacute;
     „a K&ouml;nyvt&aacute;rat haszn&aacute;l&oacute; munk&aacute;val'', t&aacute;rgyk&oacute;dk&eacute;nt
     &eacute;s/vagy forr&aacute;sk&oacute;dk&eacute;nt, &uacute;gy, hogy a haszn&aacute;l&oacute;
     m&oacute;dos&iacute;tani tudja a K&ouml;nyvt&aacute;rat &eacute;s &uacute;jra
     &ouml;ssze tudja f&ucirc;zni, hogy l&eacute;trehozhasson egy olyan v&eacute;gre-
     hajthat&oacute; programot, amely a m&oacute;dos&iacute;tott K&ouml;nyvt&aacute;rat
     tartalmazza. (Mag&aacute;t&oacute;l &eacute;rtet&otilde;d&otilde;, hogy
     az a haszn&aacute;l&oacute;, aki a K&ouml;nyvt&aacute;ron megv&aacute;ltoztatja
     a defin&iacute;ci&oacute;s f&aacute;jlok tartalm&aacute;t, nem lesz sz&uuml;ks&eacute;gszer&ucirc;en
     k&eacute;pes visszaszerkeszteni az alkalmaz&aacute;st a m&oacute;dos&iacute;tott
     defin&iacute;ci&oacute;k haszn&aacute;lat&aacute;hoz.)

<p>
<li><b>b) </b>
     Mell&eacute;kelnie kell a munk&aacute;hoz egy legal&aacute;bb h&aacute;rom &eacute;vig &eacute;rv&eacute;nyes
     &iacute;r&aacute;sos aj&aacute;nlatot arr&oacute;l, hogy &aacute;tadja
     ugyanennek a haszn&aacute;l&oacute;nak a fenti 6 alszakaszban meghat&aacute;rozott
     anyagokat a terjeszt&eacute;s megval&oacute;s&iacute;t&aacute;si k&ouml;lts&eacute;g&eacute;t
     meg nem halad&oacute; d&iacute;jaz&aacute;s&eacute;rt.

<p>
<li><b>c) </b>
     Ha a munka terjeszt&eacute;se egy megnevezett helyr&otilde;l t&ouml;rt&eacute;n&otilde; m&aacute;sol&aacute;si
     el&eacute;rhet&otilde;s&eacute;g aj&aacute;nl&aacute;sa alapj&aacute;n
     k&eacute;sz&uuml;lt, akkor az aj&aacute;nlat egyen&eacute;rt&eacute;k&ucirc;
     a fentiekben meghat&aacute;rozott anyagok ugyanazon helyr&otilde;l
     t&ouml;rt&eacute;n&otilde; m&aacute;sol&aacute;si el&eacute;rhet&otilde;s&eacute;g&eacute;vel.

<p>
<li><b>d) </b>
     Ellen&otilde;rizze, hogy a haszn&aacute;l&oacute; m&aacute;r megkapta ezeket az anyagokat, vagy
     m&aacute;r elk&uuml;ld&ouml;tt egy m&aacute;solatot ennek a haszn&aacute;l&oacute;nak.

</ul>
<p><br>V&eacute;grehajthat&oacute; program eset&eacute;n „a K&ouml;nyvt&aacute;rat
haszn&aacute;l&oacute; munka'' sz&uuml;ks&eacute;ges form&aacute;j&aacute;ba
bele kell &eacute;rteni annyi adatot &eacute;s utility programot, amennyi
abb&oacute;l a v&eacute;grehajthat&oacute; program reproduk&aacute;l&aacute;s&aacute;hoz
sz&uuml;ks&eacute;ges. Azonban, speci&aacute;lis kiv&eacute;tel- k&eacute;nt,
a terjesztett forr&aacute;sk&oacute;dnak nem kell semmi olyan tartalmaznia,
amit rendes k&ouml;r&uuml;lm&eacute;nyek k&ouml;z&ouml;tt az oper&aacute;ci&oacute;s
rendszerek f&otilde; elemeik&eacute;nt (compiler, kernel, stb.) terjesztenek
(ak&aacute;r forr&aacute;s, ak&aacute;r bin&aacute;ris form&aacute;ban),
amelyek alatt v&eacute;grehajthat&oacute; program fut, tekintet n&eacute;lk&uuml;l
arra, hogy maguk az elemek velej&aacute;r&oacute;i a v&eacute;grehajthat&oacute;
programnak.
<p>Megt&ouml;rt&eacute;nhet, hogy ez a k&ouml;vetelm&eacute;ny ellentmond
m&aacute;s tulajdon&uacute; k&ouml;nyvt&aacute;rak jogos&iacute;tv&aacute;nyi
korl&aacute;toz&aacute;sainak, amelyek nincsenek &aacute;ltal&aacute;nos
esetben az oper&aacute;ci&oacute;s rendszerhez mell&eacute;kelve. Ilyen
ellentmond&aacute;s azt jelenti, hogy nem haszn&aacute;lhatja mindkett&otilde;t
&eacute;s vele egy&uuml;tt a K&ouml;nyvt&aacute;rat a v&eacute;grehajthat&oacute;
programban, amelyet terjeszt.
<p><b>7. </b>Elhelyezhet olyan k&ouml;nyvt&aacute;ri szolg&aacute;ltat&aacute;sokat,
amelyek egym&aacute;s mellett egy K&ouml;nyvt&aacute;ron alapul&oacute;
munka egy egyszer&ucirc; k&ouml;nyvt&aacute;rban egy&uuml;tt m&aacute;sik
k&ouml;nyvt&aacute;ri szolg&aacute;ltat&aacute;ssal, amely nincs lefedve
ezzel a Jogos&iacute;tv&aacute;nnyal, &eacute;s terjesztheti ilyen kombin&aacute;lt
k&ouml;nyvt&aacute;rk&eacute;nt, felt&eacute;ve, hogy ezt a k&eacute;t
dolgot megteszi:

<ul>

<li><b>a) </b>
     Ell&aacute;tja a kombin&aacute;lt k&ouml;nyvt&aacute;rat ugyanennek a K&ouml;nyvt&aacute;ron
     alapul&oacute; munk&aacute;nak egy m&aacute;solat&aacute;val, kombin&aacute;latlanul
     egy m&aacute;sik k&ouml;nyvt&aacute;ri szolg&aacute;ltat&aacute;ssal. Ezt
     a fenti szakasz k&ouml;vetelm&eacute;nyei szerint kell terjeszteni.

<p>
<li><b>b)</b>
     Adjon szembet&ucirc;n&otilde; nyilatkozatot a k&ouml;nyvt&aacute;rral arr&oacute;l a t&eacute;nyr&otilde;l,
     hogy annak egy r&eacute;sze a K&ouml;nyvt&aacute;ron alapul&oacute; munka,
     &eacute;s elmagyar&aacute;zva, hogy hol lehet meg- tal&aacute;lni a vele
     j&aacute;r&oacute; kombin&aacute;latlan form&aacute;j&aacute;t ugyanennek
     a munk&aacute;nak.

</ul>

<p><br><b>8.</b> Nem szabad m&aacute;solnia, m&oacute;dos&iacute;tania,
aljogos&iacute;tv&aacute;nnyal ell&aacute;tnia, m&aacute;ssal &ouml;sszeszerkesztenie,
vagy terjesztenie a K&ouml;nyvt&aacute;rat, kiv&eacute;ve, ha ez kifejezetten
&iacute;gy rendelkezik ezen Jogos&iacute;tv&aacute;ny szerint. B&aacute;rmely
k&iacute;s&eacute;rlet egy&eacute;bk&eacute;nt a K&ouml;nyvt&aacute;r m&aacute;sol&aacute;s&aacute;ra,
m&oacute;dos&iacute;t&aacute;s&aacute;ra, aljogos&iacute;tv&aacute;nnyal
ell&aacute;t&aacute;s&aacute;ra, m&aacute;ssal &ouml;sszeszerkeszt&eacute;-
s&eacute;re &eacute;rv&eacute;nytelen, &eacute;s automatikusan megsz&uuml;nteti
az &ouml;n jogait erre a Jogos&iacute;tv&aacute;ny- ra vonatkoz&oacute;an.
Tov&aacute;bb&aacute;, azok a felek, akik kaptak a m&aacute;solatokb&oacute;l,
vagy jogokb&oacute;l, amelyek &ouml;nt ezen Jogos&iacute;tv&aacute;ny szerint
m&aacute;r nem illett&eacute;k meg, az &otilde; jogosults&aacute;guk is
megsz&ucirc;nik mindaddig, m&iacute;g az ilyen partners&eacute;gben szolg&aacute;lat-
k&eacute;szek maradnak.
<p><b>9.</b> &Ouml;n nincs ennek a Jogos&iacute;tv&aacute;nynak a elfogad&aacute;s&aacute;ra
k&ouml;telezve, mivel nem &iacute;rta azt al&aacute;. Azonban semmi m&aacute;s
egy&eacute;b nem adhat enged&eacute;lyt a K&ouml;nyvt&aacute;r vagy sz&aacute;rmaz&eacute;kos
munk&aacute;inak m&oacute;dos&iacute;t&aacute;s&aacute;ra vagy terjeszt&eacute;s&eacute;re.
Ezeket a m&ucirc;veleteket a t&ouml;rv&eacute;ny tiltja, ha nem fogadja
el ezt a Jogos&iacute;tv&aacute;nyt. Ennek ok&aacute;&eacute;rt, a K&ouml;nyvt&aacute;r
(vagy a K&ouml;nyvt&aacute;ron alapul&oacute; valamely munka) m&oacute;dos&iacute;t&aacute;sa
vagy terjeszt&eacute;se eset&eacute;n fel kell t&uuml;ntetnie ezen Jogos&iacute;tv&aacute;ny
&ouml;n &aacute;ltali elfogad&aacute;s&aacute;t, &eacute;s ezzel annak
minden k&ouml;vetelm&eacute;ny&eacute;t &eacute;s felt&eacute;tel&eacute;t
a K&ouml;nyvt&aacute;r vagy azon alapul&oacute; munk&aacute;k terjeszt&eacute;s&eacute;re
vagy m&oacute;dos&iacute;t&aacute;s&aacute;ra.
<p><b>10.</b> Mindenkor, amikor &uacute;jra elosztja a K&ouml;nyvt&aacute;rat
(vagy a K&ouml;nyvt&aacute;ron alapul&oacute; valamilyen munk&aacute;t),
a c&iacute;mzett automatikusan elnyeri az eredeti jogosult jogos&iacute;tv&aacute;ny&aacute;t
az ezen a kik&ouml;t&eacute;sek &eacute;s felt&eacute;telek t&aacute;rgy&aacute;t
k&eacute;pez&otilde; K&ouml;nyvt&aacute;r m&aacute;sol&aacute;s&aacute;ra,
terjeszt&eacute;s&eacute;re, m&aacute;ssal &ouml;sszeszerkeszt&eacute;s&eacute;re
vagy m&oacute;dos&iacute;t&aacute;s&aacute;ra. Nem k&ouml;thet ki b&aacute;rmilyen
egy&eacute;b korl&aacute;toz&aacute;st a c&iacute;mzett gyakorlat&aacute;ban,
mint amit ebben a t&ouml;rv&eacute;nyek megengednek. Nem felel&otilde;ss&eacute;ge
enged&eacute;kenys&eacute;ge k&eacute;nyszer&iacute;teni harmadik felet
ezen Jogos&iacute;tv&aacute;ny ir&aacute;nt.
<p><b>11.</b> Ha b&iacute;r&oacute;s&aacute;gi hat&aacute;rozat vagy szabadalom
s&eacute;rt&eacute;s ok&aacute;n vagy egy&eacute;b (szabadalom kiad&aacute;ssal
nem korl&aacute;tozott) egy&eacute;b ok k&ouml;vetkezm&eacute;nyek&eacute;nt
felt&eacute;telek vannak &ouml;nre kir&oacute;va (ak&aacute;r b&iacute;r&oacute;i
rendelkez&eacute;ssel, megegyez&eacute;ssel, ak&aacute;r egy&eacute;b m&oacute;don),
amelyek ellentmondanak ezen Jogos&iacute;tv&aacute;ny felt&eacute;teleinek,
ezek nem ny&uacute;jtanak felment&eacute;st &ouml;nnek ezen Jogos&iacute;tv&aacute;ny
felt&eacute;telei al&oacute;l. Ha &ouml;n nem tud &uacute;gy terjeszteni,
hogy egy&uuml;ttesen eleget tegyen ezen Jogos&iacute;tv&aacute;nyb&oacute;l
ered&otilde; k&ouml;telezetts&eacute;geinek &eacute;s m&aacute;s ide vonatkoz&oacute;
k&ouml;telezetts&eacute;geinek, akkor ennek k&ouml;vetkezm&eacute;nyek&eacute;nt
a K&ouml;nyvt&aacute;rat egy&aacute;ltal&aacute;n nem terjesztheti. P&eacute;ld&aacute;ul,
ha egy szabadalmi jogos&iacute;tv&aacute;ny nem engedi meg szerz&otilde;i
jogd&iacute;j-mentesen a K&ouml;nyvt&aacute;r
&uacute;jraeloszt&aacute;s&aacute;t
b&aacute;rki &aacute;ltal, aki k&ouml;zvet- len&uuml;l vagy k&ouml;zvetetten
az &ouml;n r&eacute;v&eacute;n m&aacute;solathoz jutott, akkor az egyetlen
lehet&otilde;s&eacute;g, hogy eleget tehessen ennek &eacute;s a Jogos&iacute;tv&aacute;nynak
az, hogy teljesen tart&oacute;zkodik a K&ouml;nyvt&aacute;r terjeszt&eacute;s&eacute;t&otilde;l.
<p>Ha ennek a szakasznak valamely r&eacute;sz&eacute;t &eacute;rv&eacute;nytelennek
vagy &eacute;rv&eacute;nyes&iacute;thetetlennek tartja saj&aacute;tos k&ouml;r&uuml;lm&eacute;nyek
k&ouml;z&ouml;tt, a szakasz marad&eacute;ka van alkalmaz&aacute;sra sz&aacute;nva,
&eacute;s a szakasz eg&eacute;sze m&aacute;s k&ouml;r&uuml;lm&eacute;nyek
k&ouml;z&ouml;tti alkalmaz&aacute;sra van sz&aacute;nva.
<p>Nem c&eacute;lja ennek a szakasznak r&aacute;b&iacute;rni &ouml;nt valamely
szabadalom vagy tulajdonjogi
<br>ig&eacute;ny megs&eacute;rt&eacute;s&eacute;re vagy ilyen ig&eacute;ny
&eacute;rv&eacute;nyess&eacute;g&eacute;&eacute;rt k&uuml;zdeni: ennek
a szakasznak
<br>egyetlen c&eacute;lja, hogy megv&eacute;dje a szabad szoftverek terjeszt&eacute;si
rendszer&eacute;nek
<br>s&eacute;rtetlens&eacute;g&eacute;t, amely a nyilv&aacute;nos jogos&iacute;tv&aacute;ny
gyakorlat&aacute;ban teljes&uuml;l. Sok ember
<br>adott nagylelk&ucirc; hozz&aacute;j&aacute;rul&aacute;st az ezzel a
rendszerrel terjesztett szoftverek
<br>sz&eacute;les sokas&aacute;g&aacute;hoz bizalommal a rendszerrel terjesztett
szoftverek
<br>sz&eacute;les sokas&aacute;g&aacute;hoz bizalommal a rendszer k&ouml;vetkezetes
alkalmaz&aacute;sa ir&aacute;nt: a
<br>szerz&otilde;n/adom&aacute;nyoz&oacute;n m&uacute;lik a d&ouml;nt&eacute;s,
hogy k&eacute;sz szoftvert terjeszteni egy m&aacute;s
<br>rendszerben &eacute;s az enged&eacute;lyesre nem h&aacute;rulhat ez
a v&aacute;laszt&aacute;s.
<p>Ez a szakasz arra van sz&aacute;nva, hogy teljesen tiszt&aacute;zza,
mi a n&eacute;zet&uuml;nk ezen Jogos&iacute;tv&aacute;ny adta t&aacute;masz
fontoss&aacute;g&aacute;r&oacute;l.
<p><b>12.</b> Ha a K&ouml;nyvt&aacute;r terjeszt&eacute;se &eacute;s/vagy
haszn&aacute;lata bizonyos orsz&aacute;gokban korl&aacute;tozva van ak&aacute;r
szabadalmakkal, ak&aacute;r szerz&otilde;i jogi egyezm&eacute;nyekkel eredeti
szerz&otilde;i jog tulajdonos, aki a K&ouml;nyvt&aacute;rat ezen Jogos&iacute;tv&aacute;ny
hat&aacute;lya al&aacute; helyezte, hozz&aacute;tehet egy hat&aacute;rozott
f&ouml;ldrajzi terjeszt&eacute;si hat&aacute;rol&aacute;st, amely kiz&aacute;rja
ezeket az orsz&aacute;gokat, &iacute;gy a terjeszt&eacute;s csak az &iacute;gy
ki nem z&aacute;rt orsz&aacute;gokban enged&eacute;lyezett. Ilyen esetben
ez a Jogos&iacute;tv&aacute;ny mag&aacute;ba foglalja a hat&aacute;rol&aacute;st,
mintha a t&ouml;rzssz&ouml;veg&eacute;be lenne &iacute;rva.
<p><b>13.</b> A Szabad Szoftver Alap&iacute;tv&aacute;ny id&otilde;r&otilde;l-id&otilde;re
k&ouml;zz&eacute;teheti a K&ouml;nyvt&aacute;ri &Aacute;ltal&aacute;nos
Nyilv&aacute;nos Jogos&iacute;tv&aacute;ny jav&iacute;tott vagy &uacute;j
v&aacute;ltozatait. Az ilyen &uacute;j v&aacute;ltozatok szellem&uuml;kben
hasonl&oacute;ak a jelenlegi v&aacute;ltozathoz, de r&eacute;szletekben
elt&eacute;rhetnek, hogy &uacute;j probl&eacute;m&aacute;kat &eacute;s
vonatkoz&aacute;sokat c&eacute;lozzanak meg.
<p><b>14.</b> Ha be akarja foglalni a K&ouml;nyvt&aacute;r r&eacute;szeit
m&aacute;s szabad programba, amelynek a terjeszt&eacute;si felt&eacute;telei
elt&eacute;r&otilde;ek, &iacute;r&aacute;sban k&eacute;rje a szerz&otilde;
enged&eacute;ly&eacute;t. Amely szoftver eset&eacute;ben a szerz&otilde;i
jogot a Szabad Szoftver Alap&iacute;tv&aacute;ny l&eacute;tes&iacute;tette,
&iacute;rjon a Szabad Szoftver Alap&iacute;tv&aacute;nynak: mi olykor ez&eacute;rt
kiv&eacute;telt tesz&uuml;nk. D&ouml;nt&eacute;s&uuml;nket kett&otilde;s
c&eacute;l vezeti, szabad szoftvereink minden sz&aacute;rmaz&eacute;ka
szabad st&aacute;tusnak meg&otilde;rz&eacute;se &eacute;s &aacute;ltal&aacute;ban
a szoftverek megoszt&aacute;s&aacute;nak &eacute;s &uacute;jrahaszno- s&iacute;t&aacute;s&aacute;nak
el&otilde;mozd&iacute;t&aacute;sa.
<p><b>NINCS SZAVATOSS&Aacute;G</b>
<p><b>15.</b> MIVEL A K&Ouml;NYVT&Aacute;R D&Iacute;JMENTESS&Eacute;GRE
VAN JOGOS&Iacute;TVA, A K&Ouml;NYVT&Aacute;RRA NINCS SZAVATOSS&Aacute;G
AZ ALKALMAZHAT&Oacute; T&Ouml;RV&Eacute;NY M&Eacute;RT&Eacute;K&Eacute;IG.
KIV&Eacute;VE, AMIKOR A SZERZ&Otilde;I JOG TULAJDONOS &Eacute;S/ VAGY M&Aacute;SIK
F&Eacute;L &Iacute;R&Aacute;SBELI KIJELENT&Eacute;SE FELT&Eacute;TELEZI
A K&Ouml;NYVT&Aacute;RR&Oacute;L „AHOGY VAN'', B&Aacute;RMILYEN SZAVATOSS&Aacute;G
N&Eacute;LK&Uuml;L, AK&Aacute;R NYILTAN, AK&Aacute;R BURKOLTAN,
<p>BELE&Eacute;RTVE, DE ARRA NEM KORL&Aacute;TOZVA, A FORGALOMMK&Eacute;PESS&Eacute;G
&Eacute;S HELYESS&Eacute;G SZAVATOSS&Aacute;G&Aacute;T EGY SAJ&Aacute;TS&Aacute;GOS
HASZN&Aacute;LATRA. EZZEL A K&Ouml;NYVT&Aacute;R MIN&Otilde;S&Eacute;G&Eacute;T
&Eacute;S TELJES&Iacute;TM&Eacute;NY&Eacute;T ILLET&Otilde;EN A TELJES
KOCK&Aacute;ZAT AZ &Ouml;N&Eacute;. AMENNYIBEN A K&Ouml;NYVT&Aacute;R HIB&Aacute;SNAK
BIZONYULNA, MINDEN SZ&Uuml;KS&Eacute;GES SZOLG&Aacute;LTAT&Aacute;S, JAV&Iacute;T&Aacute;S
&Eacute;S HELYESB&Iacute;T&Eacute;S K&Ouml;LTS&Eacute;G&Eacute;T &Ouml;N
V&Aacute;LLALJA.
<p><b>16.</b> CSAK HA AZ ALKALMAZHAT&Oacute; T&Ouml;RV&Eacute;NY VAGY &Iacute;R&Aacute;SBELI
EGYEZS&Eacute;G K&Ouml;TELEZI, AKKOR TARTOZIK &Ouml;NNEK FELEL&Otilde;SS&Eacute;GGEL
A SZERZ&Otilde;I JOG TULAJDONOS VAGY M&Aacute;SIK F&Eacute;L, AKI A K&Ouml;NYVT&Aacute;RAT
M&Oacute;DOS&Iacute;THATTA VAGY &Uacute;JRA ELOSZTHATTA A FENT ENGED&Eacute;LYEZETT
M&Oacute;DON, A K&Aacute;ROK&Eacute;RT, BELE&Eacute;RTVE B&Aacute;RMELY
&Aacute;LTAL&Aacute;NOS, SPECI&Aacute;LIS, ESETLEGES VAGY K&Ouml;VETKEZM&Eacute;NYES
K&Aacute;RT, AMELY HASZN&Aacute;LATON K&Iacute;V&Uuml;L VAGY A K&Ouml;NYVT&Aacute;R
ALKALMATLANS&Aacute;GA R&Eacute;V&Eacute;N KELETKEZIK (BELE&Eacute;RTVE
DE ARRA NEM KORL&Aacute;TOZVA ADATOK ELVESZT&Eacute;S&Eacute;T VAGY A PONTATLANS&Aacute;G&Aacute;T
VAGY AZ &Ouml;N &Aacute;LTAL VAGY HARMADIK F&Eacute;L &Aacute;LTAL FENNTARTOTT
ADATOK ELVESZT&Eacute;S&Eacute;T VAGY A PONTATLANS&Aacute;G&Aacute;T VAGY
A K&Ouml;NYVT&Aacute;RNAK M&Aacute;SIK SZOFTVERREL VAL&Oacute; EGY&Uuml;TTM&Ucirc;K&Ouml;D&Eacute;SE
SIKERTELENS&Eacute;G&Eacute;T), M&Eacute;G AKKOR IS, HA AZ ILYEN TULAJDONOS
VAGY M&Aacute;SIK F&Eacute;L T&Aacute;J&Eacute;KOZTAT&Aacute;ST ADOTT AZ
ILYEN VESZ&Eacute;LYEK LEHET&Otilde;S&Eacute;G&Eacute;R&Otilde;L.
<p><b>KIK&Ouml;T&Eacute;SEK &Eacute;S FELT&Eacute;TELEK V&Eacute;GE</b>
<p><b><u>F&uuml;ggel&eacute;k</u>: hogy alkalmazhatja ezeket a kik&ouml;t&eacute;seket
&eacute;s felt&eacute;teleket &uacute;j K&ouml;nyvt&aacute;raihoz</b>
<p>Ha fejleszt egy &uacute;j k&ouml;nyvt&aacute;rat, &eacute;s azt akarja,
hogy a k&ouml;z&ouml;ns&eacute;gnek a legnagyobb lehet&otilde;s&eacute;ge
legyen a haszn&aacute;lat&aacute;ra, akkor aj&aacute;nljuk, hogy szabad
szoftverk&eacute;nt k&eacute;sz&iacute;tse el azt, amelyet b&aacute;rki
&uacute;jra eloszthat &eacute;s v&aacute;ltoztathat. Ezt &iacute;gy megteheti
az &uacute;jraeloszt&aacute;snak az enged&eacute;lyez&eacute;s&eacute;vel
az itteni felt&eacute;telek szerint (vagy v&aacute;laszthat&oacute;an a
k&ouml;z&ouml;ns&eacute;ges &Aacute;ltal&aacute;nos Nyilv&aacute;nos Jogos&iacute;tv&aacute;ny
k&ouml;vetelm&eacute;nyei szerint).
<p>Ehhez, csatolja a k&ouml;vetkez&otilde; k&ouml;zlem&eacute;nyeket a
k&ouml;nyvt&aacute;rhoz. Legbiztosabb ezeket minden forr&aacute;s f&aacute;jl
kezdet&eacute;hez csatolni, hogy a leghat&aacute;sosabban k&ouml;zvet&iacute;tse
a szavatoss&aacute;g kiz&aacute;r&aacute;s&aacute;t: &eacute;s minden f&aacute;jlban
lennie kell legal&aacute;bb „copyright „ sornak &eacute;s egy mutat&oacute;nak,
hogy hol tal&aacute;lhat&oacute; a teljes sz&ouml;veg.
</p>
<pre>
<var>egy sor megadni a program nev&eacute;t &eacute;s egy r&ouml;vid terv arr&oacute;l, 
hogy mit csin&aacute;l.</var>
Copyright (C) &lt;<var>&eacute;v</var>> &lt;<var>szerz&otilde; neve</var>>
<p>Ez a k&ouml;nyvt&aacute;r szabad szoftver, &uacute;jra eloszthatja
&eacute;s m&oacute;dos&iacute;thatja a GNU K&ouml;nyvt&aacute;ri &Aacute;ltal&aacute;nos
Nyilv&aacute;nos Jogos&iacute;tv&aacute;ny k&ouml;vetelm&eacute;nyei szerint,
melyet a Szabad Szoftver Alap&iacute;tv&aacute;ny tett k&ouml;zz&eacute;,
vagy a Jogos&iacute;tv&aacute;ny 2. vagy (v&aacute;laszt&aacute;sa szerint)
k&eacute;s&otilde;bbi verzi&oacute;ja alapj&aacute;n.
<p>Ez a k&ouml;nyvt&aacute;r abban a rem&eacute;nyben van terjesztve,
hogy hasznos lesz, de MINDEN SZAVATOSS&Aacute;G N&Eacute;LK&Uuml;L: ide&eacute;rtve
a FORGALOMK&Eacute;PESS&Eacute;G &Eacute;S EGYEDI HASZN&Aacute;LHAT&Oacute;S&Aacute;G
HELYESS&Eacute;G&Eacute;NEK szavatoss&aacute;g&aacute;t is. L&aacute;sd
a GNU K&ouml;nyvt&aacute;ri &Aacute;ltal&aacute;nos Nyilv&aacute;nos Jogos&iacute;tv&aacute;nyt
a r&eacute;szletekr&otilde;l.
<p>Meg kell kapnia egy m&aacute;solat&aacute;t a GNU K&ouml;nyvt&aacute;ri
&Aacute;ltal&aacute;nos Nyilv&aacute;nos Jogos&iacute;tv&aacute;nynak ezzel
a programmal: ha nem, &iacute;rjon a Szabad Szoftver Alap&iacute;tv&aacute;ny
Inc.-nak 675 Mass Ave, Cambridge, MA 02139, USA
</pre>
<p>Adjon arr&oacute;l is inform&aacute;ci&oacute;t, hogyan tudnak &ouml;nnel
kapcsolatba l&eacute;pni elektronikus vagy hagyom&aacute;nyos posta &uacute;tj&aacute;n.
<p>Meg kell adni a munk&aacute;ltat&oacute;j&aacute;t is (ha programoz&oacute;k&eacute;nt
dolgozik) vagy iskolai v&eacute;gzetts&eacute;g&eacute;t, ha van, jelezni
a „szerz&otilde;i jogr&oacute;l lemond&aacute;st'' a k&ouml;nyvt&aacute;rr&oacute;l,
ha sz&uuml;ks&eacute;ges. &Iacute;me egy p&eacute;lda, megv&aacute;ltoztatott
nevekkel:
<p>
<pre>
Yoyodyne, Inc., ezennel lemond minden szerz&otilde;i jogi &eacute;rdekelts&eacute;g&eacute;r&otilde;l
Random Hacker J&aacute;nos &aacute;ltal &iacute;rt „Frob'' k&ouml;nyvt&aacute;rban
(egy k&ouml;nyvt&aacute;r forgat&oacute; gombokhoz).
<p>&lt;<var>Ravasz Tibor al&aacute;&iacute;r&aacute;sa</var>>, 1989. &aacute;prilis 1.
Ravasz Tibor, az eln&ouml;k helyett
</pre>
<p>ez minden amit meg kell tennie!
</body>
</html>
